import os

# ==========================================
# ⚙️ 全局配置中心
# ==========================================
API_KEY = "sk-H1t1DW6tpVWFNG0BEASDFJtWxvgSrrtkYYYK54QGDj9UvNj9" 
BASE_URL = "https://yunwu.ai/v1"         
BASE_DIR = r"D:\TikTok_App_Server"
USERS_DIR = os.path.join(BASE_DIR, "Users")
LOGS_DIR = os.path.join(BASE_DIR, "Logs")
CACHE_DIR = os.path.join(BASE_DIR, "Cache")

VIDEO_EXTENSIONS = ('.mp4', '.mov', '.avi', '.mkv', '.webm', '.flv')

LOG_EMPLOYEE = os.path.join(LOGS_DIR, "Employee_Usage")
LOG_STORAGE = os.path.join(LOGS_DIR, "Storage_Records")
LOG_ADMIN = os.path.join(LOGS_DIR, "Admin_Operations")

DB_FILE = os.path.join(BASE_DIR, "database.db")
OLD_DB_FILE = os.path.join(BASE_DIR, "database.json")

# 初始化创建目录
for d in [USERS_DIR, LOG_EMPLOYEE, LOG_STORAGE, LOG_ADMIN, CACHE_DIR]: 
    os.makedirs(d, exist_ok=True)

# 字典映射配置
CATEGORY_MAP = {
    120: "全部 / 聚合入口", 119: "唱歌 / 跳舞", 118: "科技 / 数码", 117: "健身 / 健康",
    116: "知识 / 教育", 115: "汽车", 114: "社会 / 观点 / 纪实", 113: "宠物 / 动物",
    112: "体育 / 运动", 111: "美食", 110: "对口型 / 模仿表演", 109: "穿搭 / 服饰",
    108: "剧情 / 短剧 / 演绎", 107: "情感 / 恋爱 / 两性关系", 106: "家庭 / 亲子", 105: "日常 / 生活记录",
    104: "搞笑 / 幽默", 103: "游戏", 102: "美妆 / 护肤", 101: "综艺 / 剧集", 100: "动漫 / 二次元"
}

DIVERSIFICATION_MAP = {
    10000: "剧情搞笑", 10001: "路人整蛊", 10002: "搞笑翻车", 10003: "泛搞笑",
    10004: "剧情短剧", 10005: "跳舞", 10006: "魔术", 10008: "专业特效",
    10009: "唱歌 / 乐器", 10011: "才艺", 10012: "恋爱 / 情感", 10013: "励志 / 激励",
    10014: "日记 / Vlog", 10015: "校园生活", 10017: "婴儿 / 宝宝", 10018: "家庭",
    10019: "宠物", 10020: "农场动物", 10021: "动物", 10022: "环保",
    10024: "社会新闻", 10025: "美发", 10026: "美妆", 10027: "美容护理",
    10028: "美甲", 10029: "穿搭", 10032: "美妆穿搭", 10033: "DIY / 手工",
    10034: "生活技巧", 10035: "平面设计", 10036: "艺术创作", 10037: "解压视频",
    10039: "食物展示", 10040: "烹饪 / 做饭", 10041: "吃播 / 试吃", 10042: "饮品",
    10043: "旅行", 10044: "家居 / 园艺", 10045: "影视作品", 10046: "音乐",
    10047: "戏剧 / 舞台", 10049: "娱乐新闻", 10050: "玩具 / 收藏", 10051: "角色扮演",
    10052: "漫画 / 动画", 10056: "电子游戏", 10057: "非电子游戏", 10058: "极限运动",
    10059: "传统体育", 10060: "体育新闻", 10061: "健身", 10062: "汽车 / 卡车",
    10063: "汽车", 10064: "风景 / 植物", 10067: "科技产品", 10068: "学校教育",
    10070: "工作 / 职业", 10071: "对口型", 10073: "自拍", 10080: "手指舞",
    10081: "街头采访", 10082: "摄影", 10085: "探店", 10086: "休闲设施",
    10087: "社会议题", 10088: "明星剪辑", 10089: "灵异 / 恐怖", 10091: "个人成长",
    10092: "人文", 10093: "商业 / 金融", 10094: "科学", 10095: "软件 / 应用", 10096: "健康 / 养生"
}